10/data/attachments/b9e12760502fc8a9.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:sendInvitationRequest>
            <nif:username>Richard_detail_Friend_51012_6</nif:username>
            <nif:friendToBeRequested>soap_friends_7444482f-8ed0-41ff-ad95-d03ed854b623</nif:friendToBeRequested>
        </nif:sendInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>